Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f456z(e-c)xx-pinctrl.h
/* SPI4_CS */
#define SPI4_CS_PB6 \
	AT32_PIN_MUX('B', 6, MUX_6)
#define SPI4_CS_PB12 \
	AT32_PIN_MUX('B', 12, MUX_6)
#define SPI4_CS_PE4 \
	AT32_PIN_MUX('E', 4, MUX_5)
#define SPI4_CS_PE11 \
	AT32_PIN_MUX('E', 11, MUX_5)
#define SPI4_CS_PG14 \
	AT32_PIN_MUX('G', 14, MUX_6)

/* SPI4_MISO */
#define SPI4_MISO_PA11 \
	AT32_PIN_MUX('A', 11, MUX_6)
#define SPI4_MISO_PB8 \
	AT32_PIN_MUX('B', 8, MUX_6)
#define SPI4_MISO_PD0 \
	AT32_PIN_MUX('D', 0, MUX_5)
#define SPI4_MISO_PE5 \
	AT32_PIN_MUX('E', 5, MUX_5)
#define SPI4_MISO_PE13 \
	AT32_PIN_MUX('E', 13, MUX_5)
#define SPI4_MISO_PG12 \
	AT32_PIN_MUX('G', 12, MUX_6)

/* SPI4_MOSI */
#define SPI4_MOSI_PA1 \
	AT32_PIN_MUX('A', 1, MUX_5)
#define SPI4_MOSI_PB9 \
	AT32_PIN_MUX('B', 9, MUX_6)
#define SPI4_MOSI_PE6 \
	AT32_PIN_MUX('E', 6, MUX_5)
#define SPI4_MOSI_PE14 \
	AT32_PIN_MUX('E', 14, MUX_5)
#define SPI4_MOSI_PG13 \
	AT32_PIN_MUX('G', 3, MUX_6)

/* SPI4_SCK */
#define SPI4_SCK_PB7 \
	AT32_PIN_MUX('B', 7, MUX_6)
#define SPI4_SCK_PB13 \
	AT32_PIN_MUX('B', 13, MUX_6)
#define SPI4_SCK_PE2 \
	AT32_PIN_MUX('E', 2, MUX_5)
#define SPI4_SCK_PE12 \
	AT32_PIN_MUX('E', 12, MUX_5)
#define SPI4_SCK_PG11 \
	AT32_PIN_MUX('G', 11, MUX_6)

/* SWCLK */
#define SWCLK_PA14 \
	AT32_PIN_MUX('A', 14, MUX_0)

/* SWDIO */
#define SWDIO_PA13 \
	AT32_PIN_MUX('A', 13, MUX_0)

/* SWO */
#define SWO_PB3 \
	AT32_PIN_MUX('B', 3, MUX_0)

/* TMR10_CH1 */
#define TMR10_CH1_PB8 \
	AT32_PIN_MUX('B', 8, MUX_3)
#define TMR10_CH1_PF6 \
	AT32_PIN_MUX('F', 6, MUX_3)

/* TMR10_CH1C */
#define TMR10_CH1C_PB6 \
	AT32_PIN_MUX('B', 6, MUX_3)

/* TMR10_BRK */
#define TMR10_BRK_PB5 \
	AT32_PIN_MUX('B', 5, MUX_3)

/* TMR11_CH1 */
#define TMR11_CH1_PB9 \
	AT32_PIN_MUX('B', 9, MUX_3)
#define TMR11_CH1_PC12 \
	AT32_PIN_MUX('C', 12, MUX_3)
#define TMR11_CH1_PF7 \
	AT32_PIN_MUX('F', 7, MUX_3)

/* TMR11_CH1C */
#define TMR11_CH1C_PB7 \
	AT32_PIN_MUX('B', 7, MUX_9)

/* TMR12_CH1 */
#define TMR12_CH1_PB14 \
	AT32_PIN_MUX('B', 14, MUX_9)

/* TMR12_CH1C */
#define TMR12_CH1C_PB13 \
	AT32_PIN_MUX('B', 13, MUX_3)
#define TMR12_CH1C_PB15 \
	AT32_PIN_MUX('B', 15, MUX_14)

/* TMR12_CH2 */
#define TMR12_CH2_PB15 \
	AT32_PIN_MUX('B', 15, MUX_9)

/* TMR12_CH2C */
#define TMR12_CH2C_PD8 \
	AT32_PIN_MUX('D', 8, MUX_9)

/* TMR12_BRK */
#define TMR12_BRK_PB12 \
	AT32_PIN_MUX('B', 12, MUX_3)

/* TMR13_CH1 */
#define TMR13_CH1_PA6 \
	AT32_PIN_MUX('A', 6, MUX_9)
#define TMR13_CH1_PC4 \
	AT32_PIN_MUX('C', 4, MUX_9)
#define TMR13_CH1_PE0 \
	AT32_PIN_MUX('E', 0, MUX_9)
#define TMR13_CH1_PF8 \
	AT32_PIN_MUX('F', 8, MUX_9)

/* TMR13_CH1C */
#define TMR13_CH1C_PA5 \
	AT32_PIN_MUX('A', 5, MUX_9)
#define TMR13_CH1C_PC5 \
	AT32_PIN_MUX('C', 5, MUX_9)

/* TMR13_BRK */
#define TMR13_BRK_PA5 \
	AT32_PIN_MUX('B', 11, MUX_9)

/* TMR14_CH1 */
#define TMR14_CH1_PA4 \
	AT32_PIN_MUX('A', 4, MUX_9)
#define TMR14_CH1_PA7 \
	AT32_PIN_MUX('A', 7, MUX_9)
#define TMR14_CH1_PB1 \
	AT32_PIN_MUX('B', 1, MUX_14)
#define TMR14_CH1_PE1 \
	AT32_PIN_MUX('E', 1, MUX_9)
#define TMR14_CH1_PF9 \
	AT32_PIN_MUX('F', 9, MUX_9)

/* TMR14_CH1C */
#define TMR14_CH1C_PB2 \
	AT32_PIN_MUX('B', 2, MUX_14)
#define TMR14_CH1C_PE2 \
	AT32_PIN_MUX('E', 2, MUX_13)

/* TMR14_BRK */
#define TMR14_BRK_PA9 \
	AT32_PIN_MUX('A', 9, MUX_9)
#define TMR14_BRK_PE3 \
	AT32_PIN_MUX('E', 3, MUX_9)

/* TMR1_BRK */
#define TMR1_BRK_PA6 \
	AT32_PIN_MUX('A', 6, MUX_1)
#define TMR1_BRK_PB12 \
	AT32_PIN_MUX('B', 12, MUX_1)
#define TMR1_BRK_PE15 \
	AT32_PIN_MUX('E', 15, MUX_1)

/* TMR1_CH1 */
#define TMR1_CH1_PA8 \
	AT32_PIN_MUX('A', 8, MUX_1)
#define TMR1_CH1_PC6 \
	AT32_PIN_MUX('C', 6, MUX_1)
#define TMR1_CH1_PE9 \
	AT32_PIN_MUX('E', 9, MUX_1)
#define TMR1_CH1_PH0 \
	AT32_PIN_MUX('H', 0, MUX_1)

/* TMR1_CH1C */
#define TMR1_CH1C_PA7 \
	AT32_PIN_MUX('A', 7, MUX_1)
#define TMR1_CH1C_PB13 \
	AT32_PIN_MUX('B', 13, MUX_1)
#define TMR1_CH1C_PE8 \
	AT32_PIN_MUX('E', 8, MUX_1)

/* TMR1_CH2 */
#define TMR1_CH2_PA9 \
	AT32_PIN_MUX('A', 9, MUX_1)
#define TMR1_CH2_PC7 \
	AT32_PIN_MUX('C', 7, MUX_1)
#define TMR1_CH2_PE11 \
	AT32_PIN_MUX('E', 11, MUX_1)

/* TMR1_CH2C */
#define TMR1_CH2C_PB0 \
	AT32_PIN_MUX('B', 0, MUX_1)
#define TMR1_CH2C_PB14 \
	AT32_PIN_MUX('B', 14, MUX_1)
#define TMR1_CH2C_PE1 \
	AT32_PIN_MUX('E', 1, MUX_1)
#define TMR1_CH2C_PE10 \
	AT32_PIN_MUX('E', 10, MUX_1)
#define TMR1_CH2C_PH1 \
	AT32_PIN_MUX('H', 1, MUX_1)

/* TMR1_CH3 */
#define TMR1_CH3_PA10 \
	AT32_PIN_MUX('A', 10, MUX_1)
#define TMR1_CH3_PC8 \
	AT32_PIN_MUX('C', 8, MUX_1)
#define TMR1_CH3_PE13 \
	AT32_PIN_MUX('E', 13, MUX_1)

/* TMR1_CH3C */
#define TMR1_CH3C_PB1 \
	AT32_PIN_MUX('B', 1, MUX_1)
#define TMR1_CH3C_PB15 \
	AT32_PIN_MUX('B', 15, MUX_1)
#define TMR1_CH3C_PE12 \
	AT32_PIN_MUX('E', 12, MUX_1)

/* TMR1_CH4 */
#define TMR1_CH4_PA11 \
	AT32_PIN_MUX('A', 11, MUX_1)
#define TMR1_CH4_PC9 \
	AT32_PIN_MUX('C', 9, MUX_1)
#define TMR1_CH4_PE14 \
	AT32_PIN_MUX('E', 14, MUX_1)

/* TMR1_EXT */
#define TMR1_EXT_PA12 \
	AT32_PIN_MUX('A', 12, MUX_1)
#define TMR1_EXT_PE7 \
	AT32_PIN_MUX('E', 7, MUX_1)
#define TMR1_EXT_PF10 \
	AT32_PIN_MUX('F', 10, MUX_1)

/* TMR2_CH1 */
#define TMR2_CH1_PA0 \
	AT32_PIN_MUX('A', 0, MUX_1)
#define TMR2_CH1_PA15 \
	AT32_PIN_MUX('A', 15, MUX_1)
#define TMR2_CH1_PA5 \
	AT32_PIN_MUX('A', 5, MUX_1)
#define TMR2_CH1_PB8 \
	AT32_PIN_MUX('B', 8, MUX_1)
#define TMR2_CH1_PH2 \
	AT32_PIN_MUX('H', 2, MUX_1)

/* TMR2_CH2 */
#define TMR2_CH2_PA1 \
	AT32_PIN_MUX('A', 1, MUX_1)
#define TMR2_CH2_PB3 \
	AT32_PIN_MUX('B', 3, MUX_1)
#define TMR2_CH2_PB9 \
	AT32_PIN_MUX('B', 9, MUX_1)
#define TMR2_CH2_PH3 \
	AT32_PIN_MUX('H', 3, MUX_1)

/* TMR2_CH3 */
#define TMR2_CH3_PA2 \
	AT32_PIN_MUX('A', 2, MUX_1)
#define TMR2_CH3_PB10 \
	AT32_PIN_MUX('B', 10, MUX_1)

/* TMR2_CH4 */
#define TMR2_CH4_PA3 \
	AT32_PIN_MUX('A', 3, MUX_1)
#define TMR2_CH4_PB11 \
	AT32_PIN_MUX('B', 11, MUX_1)
#define TMR2_CH4_PB2 \
	AT32_PIN_MUX('B', 2, MUX_1)

/* TMR2_EXT */
#define TMR2_EXT_PA0 \
	AT32_PIN_MUX('A', 0, MUX_1)
#define TMR2_EXT_PA15 \
	AT32_PIN_MUX('A', 15, MUX_1)
#define TMR2_EXT_PA5 \
	AT32_PIN_MUX('A', 5, MUX_1)
#define TMR2_EXT_PB8 \
	AT32_PIN_MUX('B', 8, MUX_1)

/* TMR3_CH1 */
#define TMR3_CH1_PA6 \
	AT32_PIN_MUX('A', 6, MUX_2)
#define TMR3_CH1_PB4 \
	AT32_PIN_MUX('B', 4, MUX_2)
#define TMR3_CH1_PC6 \
	AT32_PIN_MUX('C', 6, MUX_2)
#define TMR3_CH1_PE3 \
	AT32_PIN_MUX('E', 3, MUX_2)

/* TMR3_CH2 */
#define TMR3_CH2_PA7 \
	AT32_PIN_MUX('A', 7, MUX_2)
#define TMR3_CH2_PB5 \
	AT32_PIN_MUX('B', 5, MUX_2)
#define TMR3_CH2_PC7 \
	AT32_PIN_MUX('C', 7, MUX_2)
#define TMR3_CH2_PE4 \
	AT32_PIN_MUX('E', 4, MUX_2)

