Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f456z(e-c)xx-pinctrl.h
/* TMR3_CH3 */
#define TMR3_CH3_PB0 \
	AT32_PIN_MUX('B', 0, MUX_2)
#define TMR3_CH3_PC8 \
	AT32_PIN_MUX('C', 8, MUX_2)
#define TMR3_CH3_PE5 \
	AT32_PIN_MUX('E', 5, MUX_2)

/* TMR3_CH4 */
#define TMR3_CH4_PB1 \
	AT32_PIN_MUX('B', 1, MUX_2)
#define TMR3_CH4_PC9 \
	AT32_PIN_MUX('C', 9, MUX_2)
#define TMR3_CH4_PE6 \
	AT32_PIN_MUX('E', 6, MUX_2)

/* TMR3_EXT */
#define TMR3_EXT_PB2 \
	AT32_PIN_MUX('B', 2, MUX_2)
#define TMR3_EXT_PD2 \
	AT32_PIN_MUX('D', 2, MUX_2)
#define TMR3_EXT_PE2 \
	AT32_PIN_MUX('E', 2, MUX_2)

/* TMR4_CH1 */
#define TMR4_CH1_PB6 \
	AT32_PIN_MUX('B', 6, MUX_2)
#define TMR4_CH1_PD12 \
	AT32_PIN_MUX('D', 12, MUX_2)

/* TMR4_CH2 */
#define TMR4_CH2_PB7 \
	AT32_PIN_MUX('B', 7, MUX_2)
#define TMR4_CH2_PD13 \
	AT32_PIN_MUX('D', 13, MUX_2)

/* TMR4_CH3 */
#define TMR4_CH3_PB8 \
	AT32_PIN_MUX('B', 8, MUX_2)
#define TMR4_CH3_PD14 \
	AT32_PIN_MUX('D', 14, MUX_2)

/* TMR4_CH4 */
#define TMR4_CH4_PB9 \
	AT32_PIN_MUX('B', 9, MUX_2)
#define TMR4_CH4_PD15 \
	AT32_PIN_MUX('D', 15, MUX_2)

/* TMR4_EXT */
#define TMR4_EXT_PE0 \
	AT32_PIN_MUX('E', 0, MUX_2)

/* TMR8_BRK */
#define TMR8_BRK_PA6 \
	AT32_PIN_MUX('A', 6, MUX_3)
#define TMR8_BRK_PB7 \
	AT32_PIN_MUX('B', 7, MUX_3)
#define TMR8_BRK_PF12 \
	AT32_PIN_MUX('F', 12, MUX_3)

/* TMR8_CH1 */
#define TMR8_CH1_PC6 \
	AT32_PIN_MUX('C', 6, MUX_3)

/* TMR8_CH1C */
#define TMR8_CH1C_PA7 \
	AT32_PIN_MUX('A', 7, MUX_3)
#define TMR8_CH1C_PA5 \
	AT32_PIN_MUX('A', 5, MUX_3)

/* TMR8_CH2 */
#define TMR8_CH2_PC7 \
	AT32_PIN_MUX('C', 7, MUX_3)

/* TMR8_CH2C */
#define TMR8_CH2C_PB0 \
	AT32_PIN_MUX('B', 0, MUX_3)
#define TMR8_CH2C_PB14 \
	AT32_PIN_MUX('B', 14, MUX_3)

/* TMR8_CH3 */
#define TMR8_CH3_PC8 \
	AT32_PIN_MUX('C', 8, MUX_3)

/* TMR8_CH3C */
#define TMR8_CH3C_PB1 \
	AT32_PIN_MUX('B', 1, MUX_3)
#define TMR8_CH3C_PB15 \
	AT32_PIN_MUX('B', 15, MUX_3)

/* TMR8_CH4 */
#define TMR8_CH4_PC9 \
	AT32_PIN_MUX('C', 9, MUX_3)
#define TMR8_CH4_PD1 \
	AT32_PIN_MUX('D', 1, MUX_3)
	
/* TMR8_CH4C */
#define TMR8_CH4C_PD0 \
AT32_PIN_MUX('D', 0, MUX_3)
#define TMR8_CH4_PC13 \
AT32_PIN_MUX('C', 13, MUX_3)

/* TMR8_EXT */
#define TMR8_EXT_PA0 \
	AT32_PIN_MUX('A', 0, MUX_3)
#define TMR8_EXT_PF11 \
	AT32_PIN_MUX('F', 11, MUX_3)

/* TMR9_BRK */
#define TMR9_BRK_PA8 \
	AT32_PIN_MUX('A', 8, MUX_3)
#define TMR9_BRK_PE2 \
	AT32_PIN_MUX('E', 2, MUX_3)

/* TMR9_CH1 */
#define TMR9_CH1_PA2 \
	AT32_PIN_MUX('A', 2, MUX_3)
#define TMR9_CH1_PC4 \
	AT32_PIN_MUX('C', 4, MUX_3)
#define TMR9_CH1_PE5 \
	AT32_PIN_MUX('E', 5, MUX_3)

/* TMR9_CH1C */
#define TMR9_CH1C_PA1 \
    AT32_PIN_MUX('A', 1, MUX_3)
#define TMR9_CH1_PE4 \
    AT32_PIN_MUX('E', 4, MUX_3)

/* TMR9_CH2 */
#define TMR9_CH2_PA3 \
	AT32_PIN_MUX('A', 3, MUX_3)
#define TMR9_CH2_PC5 \
	AT32_PIN_MUX('C', 5, MUX_3)
#define TMR9_CH2_PE6 \
	AT32_PIN_MUX('E', 6, MUX_3)

/* TMR9_CH2C */
#define TMR9_CH2C_PA0 \
	AT32_PIN_MUX('A', 0, MUX_9)
#define TMR9_CH2C_PE3 \
	AT32_PIN_MUX('E', 3, MUX_3)

/* UART4_RX */
#define UART4_RX_PA1 \
	AT32_PIN_MUX('A', 1, MUX_8)
#define UART4_RX_PA11 \
	AT32_PIN_MUX('A', 11, MUX_13)
#define UART4_RX_PC11 \
	AT32_PIN_MUX('C', 11, MUX_8)
#define UART4_RX_PD0 \
	AT32_PIN_MUX('D', 0, MUX_8)
#define UART4_RX_PH2 \
	AT32_PIN_MUX('H', 2, MUX_8)
#define UART4_RX_PE9 \
	AT32_PIN_MUX('E', 9, MUX_8)

/* UART4_TX */
#define UART4_TX_PA0 \
	AT32_PIN_MUX('A', 0, MUX_8)
#define UART4_TX_PA12 \
	AT32_PIN_MUX('A', 12, MUX_13)
#define UART4_TX_PC10 \
	AT32_PIN_MUX('C', 10, MUX_8)
#define UART4_TX_PD1 \
	AT32_PIN_MUX('D', 1, MUX_8)
#define UART4_TX_PD10 \
	AT32_PIN_MUX('D', 10, MUX_8)
#define UART4_TX_PE8 \
	AT32_PIN_MUX('E', 8, MUX_8)
#define UART4_TX_PH3 \
	AT32_PIN_MUX('H', 3, MUX_8)

/* UART5_RX */
#define UART5_RX_PB4 \
	AT32_PIN_MUX('B', 4, MUX_13)
#define UART5_RX_PB5 \
	AT32_PIN_MUX('B', 5, MUX_8)
#define UART5_RX_PB8 \
	AT32_PIN_MUX('B', 8, MUX_8)
#define UART5_RX_PB12 \
	AT32_PIN_MUX('B', 12, MUX_12)
#define UART5_RX_PD2 \
	AT32_PIN_MUX('D', 2, MUX_8)
#define UART5_RX_PE11 \
	AT32_PIN_MUX('E', 11, MUX_8)

/* UART5_TX */
#define UART5_TX_PB3 \
	AT32_PIN_MUX('B', 3, MUX_13)
#define UART5_TX_PB6 \
	AT32_PIN_MUX('B', 6, MUX_8)
#define UART5_TX_PB9 \
	AT32_PIN_MUX('B', 9, MUX_8)
#define UART5_TX_PB13 \
	AT32_PIN_MUX('B', 13, MUX_12)
#define UART5_TX_PC12 \
	AT32_PIN_MUX('C', 12, MUX_9)
#define UART5_TX_PE10 \
	AT32_PIN_MUX('E', 10, MUX_8)

/* USART6_RX */
#define USART6_RX_PA5 \
	AT32_PIN_MUX('A', 5, MUX_8)
#define USART6_RX_PA12 \
	AT32_PIN_MUX('A', 12, MUX_8)
#define USART6_RX_PC1 \
	AT32_PIN_MUX('C', 1, MUX_8)
#define USART6_RX_PC7 \
	AT32_PIN_MUX('C', 7, MUX_8)
#define USART6_RX_PG9 \
	AT32_PIN_MUX('G', 9, MUX_8)

/* USART6_TX */
#define USART6_TX_PA4 \
	AT32_PIN_MUX('A', 4, MUX_8)
#define USART6_TX_PA11 \
	AT32_PIN_MUX('A', 11, MUX_8)
#define USART6_TX_PC0 \
	AT32_PIN_MUX('C', 0, MUX_8)
#define USART6_TX_PC6 \
	AT32_PIN_MUX('C', 6, MUX_8)
#define USART6_TX_PG14 \
	AT32_PIN_MUX('G', 14, MUX_8)

/* UART7_RX */
#define UART7_RX_PA8 \
	AT32_PIN_MUX('A', 8, MUX_9)
#define UART7_RX_PB3 \
	AT32_PIN_MUX('B', 3, MUX_9)
#define UART7_RX_PC1 \
	AT32_PIN_MUX('C', 1, MUX_9)
#define UART7_RX_PC7 \
	AT32_PIN_MUX('C', 7, MUX_9)
#define UART7_RX_PE7 \
	AT32_PIN_MUX('E', 7, MUX_9)
#define UART7_RX_PF6 \
	AT32_PIN_MUX('F', 6, MUX_8)
#define UART7_RX_PH2 \
	AT32_PIN_MUX('H', 2, MUX_9)

/* UART7_TX */
#define UART7_TX_PA15 \
	AT32_PIN_MUX('A', 15, MUX_9)
#define UART7_TX_PB4 \
	AT32_PIN_MUX('B', 4, MUX_9)
#define UART7_TX_PC0 \
	AT32_PIN_MUX('C', 0, MUX_9)
#define UART7_TX_PC6 \
	AT32_PIN_MUX('C', 6, MUX_9)
#define UART7_TX_PE8 \
	AT32_PIN_MUX('E', 8, MUX_9)
#define UART7_TX_PF7 \
	AT32_PIN_MUX('F', 7, MUX_8)
#define UART7_TX_PH3 \
	AT32_PIN_MUX('H', 3, MUX_9)

/* USART1_CK */
#define USART1_CK_PA8 \
	AT32_PIN_MUX('A', 8, MUX_7)
#define USART1_CK_PB5 \
	AT32_PIN_MUX('B', 5, MUX_7)

/* USART1_CTS */
#define USART1_CTS_PA11 \
	AT32_PIN_MUX('A', 11, MUX_7)
#define USART1_CTS_PB4 \
	AT32_PIN_MUX('B', 4, MUX_8)

/* USART1_RTS_DE */
#define USART1_RTS_DE_PA12 \
	AT32_PIN_MUX('A', 12, MUX_7)
#define USART1_RTS_DE_PB3 \
	AT32_PIN_MUX('B', 3, MUX_8)

/* USART1_RX */
#define USART1_RX_PA10 \
	AT32_PIN_MUX('A', 10, MUX_7)
#define USART1_RX_PB3 \
	AT32_PIN_MUX('B', 3, MUX_7)
#define USART1_RX_PB7 \
	AT32_PIN_MUX('B', 7, MUX_7)

/* USART1_TX */
#define USART1_TX_PA15 \
	AT32_PIN_MUX('A', 15, MUX_7)
#define USART1_TX_PA9 \
	AT32_PIN_MUX('A', 9, MUX_7)
#define USART1_TX_PB6 \
	AT32_PIN_MUX('B', 6, MUX_7)
#define USART1_TX_PB8 \
	AT32_PIN_MUX('B', 8, MUX_7)

